In [73]:
# Dependencies and Setup
import pandas as pd
import numpy as np
import requests

In [89]:
# Read in csv
file2 = "data/totalbirths2016.csv"
births16 = pd.read_csv(file2)
births16.head()

  state_of_residence   total
0            Alabama   59151
1             Alaska   11209
2            Arizona   84520
3           Arkansas   38274
4         California  488827

In [90]:
file3 = "data/totalbirths2017.csv"
births17 = pd.read_csv(file3)
births17.head()

  state_of_residence   total
0            Alabama   58941
1             Alaska   10445
2            Arizona   81872
3           Arkansas   37520
4         California  471658

In [91]:
file4 = "data/totalbirths2018.csv"
births18 = pd.read_csv(file4)
births18.head()

  state_of_residence   total
0            Alabama   57761
1             Alaska   10086
2            Arizona   80723
3           Arkansas   37018
4         California  454920

In [92]:
file5 = "data/totalbirths2019.csv"
births19 = pd.read_csv(file5)
births19.head()

  state_of_residence   total
0            Alabama   58615
1             Alaska    9822
2            Arizona   79375
3           Arkansas   36564
4         California  446479

In [93]:
file6 = "data/summary_births.csv"
summary_births = pd.read_csv(file6)
total_births = summary_births.dropna(axis=1)
total_births.head()

   year    total
0  2016  3945875
1  2017  3855500
2  2018  3791712
3  2019  3747540

# Extract and Load into Postgres(Heroku)

In [94]:
#import necessary modules
import datetime as dt
import sqlalchemy
from sqlalchemy.ext.automap import automap_base
from sqlalchemy.orm import Session
from sqlalchemy import create_engine, func
from sqlalchemy.sql import text
from flask import Flask, jsonify
connection_string = "postgres://mpiljlhpdduyfa:2332f5bec0021e7c8a94d4f2450748ccf8aeaf1a965c62cc3d3885a838a5e316@ec2-52-22-238-188.compute-1.amazonaws.com:5432/d29t1m9qk328vp"
engine = create_engine(f'{connection_string}')

In [112]:
births2016 = '''
    create table births16(
    state_of_residence varchar (250),
    total integer PRIMARY KEY
   )
'''

In [113]:
tables = {
          'births2016': births2016.strip()
         }

In [114]:
for table in tables.keys():
    print(f'dropping the table {table} if it already exists...')
    engine.execute(f'drop table IF EXISTS {table}')

dropping the table births2016 if it already exists...

In [115]:
for table , script in tables.items():
    print(f'creating the table {table}...')
    engine.execute(f'{script}')

creating the table births2016...

In [116]:
births16.to_sql(name='births2016', con=engine, if_exists='append', index=False)

In [121]:
births2017 = '''
    create table births17(
    state_of_residence varchar (250),     
    total integer
   )
'''

In [122]:
tables = {
          'births2017': births2017.strip(),
         }

In [123]:
for table in tables.keys():
    print(f'dropping the table {table} if it already exists...')
    engine.execute(f'drop table IF EXISTS {table}')

dropping the table births2017 if it already exists...

In [124]:
for table , script in tables.items():
    print(f'creating the table {table}...')
    engine.execute(f'{script}')

creating the table births2017...

In [125]:
births17.to_sql(name='births2017', con=engine, if_exists='append', index=False)

In [130]:
births2018 = '''
    create table births18(
    state_of_residence varchar (250),     
    total integer
   )
'''

In [131]:
tables = {
          'births2018': births2018.strip(),
         }

In [132]:
for table in tables.keys():
    print(f'dropping the table {table} if it already exists...')
    engine.execute(f'drop table IF EXISTS {table}')

dropping the table births2018 if it already exists...

In [133]:
for table , script in tables.items():
    print(f'creating the table {table}...')
    engine.execute(f'{script}')

creating the table births2018...

In [134]:
births18.to_sql(name='births2018', con=engine, if_exists='append', index=False)

In [139]:
births2019 = '''
    create table births19(
    state_of_residence varchar (250),     
    total integer
   )
'''

In [140]:
tables = {
          'births2019': births2019.strip()
         }

In [141]:
for table in tables.keys():
    print(f'dropping the table {table} if it already exists...')
    engine.execute(f'drop table IF EXISTS {table}')

dropping the table births2019 if it already exists...

In [142]:
for table , script in tables.items():
    print(f'creating the table {table}...')
    engine.execute(f'{script}')

creating the table births2019...

In [143]:
births19.to_sql(name='births2019', con=engine, if_exists='append', index=False)

In [148]:
births_summary = '''
    create table total_births(
    year integer,     
    total integer
   )
'''

In [149]:
tables = {
           'births_summary': births_summary          
         }

In [150]:
for table in tables.keys():
    print(f'dropping the table {table} if it already exists...')
    engine.execute(f'drop table IF EXISTS {table}')

dropping the table births_summary if it already exists...

In [151]:
for table , script in tables.items():
    print(f'creating the table {table}...')
    engine.execute(f'{script}')

creating the table births_summary...

In [152]:
total_births.to_sql(name='births_summary', con=engine, if_exists='append', index=False)

In [ ]:
%matplotlib inline
from matplotlib import style
style.use('fivethirtyeight')
import matplotlib.pyplot as plt